diroik/STM32WS/MKAB_LAST_WORK_WDT/src/Classes.cpp
//=============================================================================
#include <Classes.h>
#include <flash_map.h>
#include <stm32f10x_flash.h>


/* Flash Access Control Register bits */
#define ACR_LATENCY_Mask         ((uint32_t)0x00000038)
#define ACR_HLFCYA_Mask          ((uint32_t)0xFFFFFFF7)
#define ACR_PRFTBE_Mask          ((uint32_t)0xFFFFFFEF)

/* Flash Access Control Register bits */
#define ACR_PRFTBS_Mask          ((uint32_t)0x00000020) 

/* Flash Control Register bits */
#define CR_PG_Set                ((uint32_t)0x00000001)
#define CR_PG_Reset              ((uint32_t)0x00001FFE) 
#define CR_PER_Set               ((uint32_t)0x00000002)
#define CR_PER_Reset             ((uint32_t)0x00001FFD)
#define CR_MER_Set               ((uint32_t)0x00000004)
#define CR_MER_Reset             ((uint32_t)0x00001FFB)
#define CR_OPTPG_Set             ((uint32_t)0x00000010)
#define CR_OPTPG_Reset           ((uint32_t)0x00001FEF)
#define CR_OPTER_Set             ((uint32_t)0x00000020)
#define CR_OPTER_Reset           ((uint32_t)0x00001FDF)
#define CR_STRT_Set              ((uint32_t)0x00000040)
#define CR_LOCK_Set              ((uint32_t)0x00000080)

/* FLASH Mask */
#define RDPRT_Mask               ((uint32_t)0x00000002)
#define WRP0_Mask                ((uint32_t)0x000000FF)
#define WRP1_Mask                ((uint32_t)0x0000FF00)
#define WRP2_Mask                ((uint32_t)0x00FF0000)
#define WRP3_Mask                ((uint32_t)0xFF000000)
#define OB_USER_BFB2             ((uint16_t)0x0008)

/* FLASH Keys */
#define RDP_Key                  ((uint16_t)0x00A5)
#define FLASH_KEY1               ((uint32_t)0x45670123)
#define FLASH_KEY2               ((uint32_t)0xCDEF89AB)

/* FLASH BANK address */
#define FLASH_BANK1_END_ADDRESS   ((uint32_t)0x807FFFF)

/* Delay definition */   
#define EraseTimeout          ((uint32_t)0x000B0000)
#define ProgramTimeout        ((uint32_t)0x00002000)





//=============================================================================


//*****************************************************************************
//*** Class TObject
//*****************************************************************************
//=============================================================================
//  
//=======================================
TRtcTime  *TObject::GetRtcTime( string &date, string &time )
{
  CLEAR_WDT;
  Tlist<string> tmpvect;   
  TRtcTime *DateTime = new TRtcTime();
  TBuffer::Split(date,".",tmpvect);
  if(tmpvect.size() == 3)
  {
    DateTime->Day    = atoi(tmpvect[0].c_str());
    DateTime->Month  = atoi(tmpvect[1].c_str());
    DateTime->Year   = atoi(tmpvect[2].c_str());
  }
  else 
  { return NULL;}
  tmpvect.clear(); 
  TBuffer::Split(time,":",tmpvect);
  if(tmpvect.size() == 3)
  {
    DateTime->Hour     = atoi(tmpvect[0].c_str());
    DateTime->Minute   = atoi(tmpvect[1].c_str());
    DateTime->Second   = atoi(tmpvect[2].c_str());  
  }
  else
  { return NULL;}
  return DateTime;
}  
//=============================================================================
//  
//=======================================
void  TObject::SetDataTime(TDateTime &dt, string &date, string &time)
{
  //static bool flg = false;
  CLEAR_WDT;
  Tlist<string> tmpvect;   
  TRtcTime DateTime;
  TBuffer::Split(date,".", tmpvect);
  if(tmpvect.size() != 3)
  {
    return;
  }
  DateTime.Day    = atoi(tmpvect[0].c_str());
  DateTime.Month  = atoi(tmpvect[1].c_str());
  DateTime.Year   = atoi(tmpvect[2].c_str());
  tmpvect.clear(); 
  TBuffer::Split(time,":",tmpvect);
  if(tmpvect.size() != 3){ return;}
  DateTime.Hour     = atoi(tmpvect[0].c_str());
  DateTime.Minute   = atoi(tmpvect[1].c_str());
  DateTime.Second   = atoi(tmpvect[2].c_str());  
  
  long CurrGloalSeconds   = dt.DateTime.Hour*3600L + dt.DateTime.Minute*60L + dt.DateTime.Second*1L;
  long NewGlobalSeconds   = DateTime.Hour*3600L + DateTime.Minute*60L + DateTime.Second*1L;
  
  long div = labs(NewGlobalSeconds - CurrGloalSeconds);
  if( div > 1)//если разница большая - прямая запись значений времени
  {
    RtcTimerDivider = 32767;
    Init_SysTick(RtcTimerDivider);//сброс таймер-счетчика
    //Init_TIMER_A0(RtcTimerDivider);//сброс таймер-счетчика
    dt.SetTime(DateTime);//установка нового времени
  }
  else if(div == 1)// если разбежалось на секунду
  {
    //flg = true;
    if(NewGlobalSeconds > CurrGloalSeconds)//отстаём, нужно быстрее
    { 
      /*if(flg == false)
      {
        RtcTimerDivider -=1;
        flg = true;
      }*/
      Init_SysTick(2);//программно подводим часы чтоб секунда сработала быстрее
      //Init_TIMER_A0(2);//программно подводим часы чтоб секунда сработала быстрее
    }
    else//спешим
    { 
      /*if(flg == false)
      {
        RtcTimerDivider +=1;
        flg = true;
      }*/
      Init_SysTick(RtcTimerDivider+16384);// чтоб секунда сработала медленнее 
      //Init_TIMER_A0(RtcTimerDivider+16384);// чтоб секунда сработала медленнее 
    }
  }
  //else//все ок
  //{ flg = false;}
}
//=============================================================================
// Запись в память констант  
//=======================================
bool TObject::Save_ParamsInInfo(Data_Params  *Params)
{
//Перезапись всей страницы с временным(защитным) хранилищем в другой странице 
 Word         Len;
 Byte        *Tmp                  = (Byte *)Params;  //взяли указатель 
  
  Len = sizeof(*Params); 
  for(Word i=0; i<3; i++)
  {
    WriteBufToPage((Byte const*)&TMP_PARAMS, Tmp, Len-1 );  //записали во временную(защитную) память
    WriteBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
  
    if(VerifyMemory((Byte const*)&PARAMS,Tmp, Len))
    {//удалили временную запись 
      ClrFlashSegment( (Byte const*)&TMP_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;
}
//=============================================================================
//  
//=======================================
bool TObject::VerifyMemory(Byte const* DestAddr, Byte* ScrAddr,Word Len)
{
  for(Word i=0; i<Len; i++)
  {
    CLEAR_WDT;
    if(DestAddr[i]!=ScrAddr[i])
    { return false;}
  }
  return true; 
}
//=============================================================================
//  
//=======================================
bool TObject::RestoreMemParams(void)
{
 Word         Len;
 Data_Params  TmpParam            = *PtrToConstants;    //сохранили текущие значения параметров в оперативке
 Byte        *Tmp                 = (Byte *)&TmpParam;  //взяли указатель 
  
  Len = sizeof(TmpParam);
  
  for(Word i = 0;i<3;i++)
  {
    CLEAR_WDT;
    WriteBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
    if(VerifyMemory((Byte const*)&PARAMS,Tmp, Len))
    {//удалили временную запись 
      ClrFlashSegment( (Byte const*)&TMP_PARAMS );
      return true; 
    }
    else
    { 
      continue;
    }
  }
  return false;  
}
//=============================================================================
//  
//=======================================
void TObject::RestoreDefault(void)
{
  Word         Len;
  Data_Params  TmpParam;
  Byte        *Tmp             = (Byte *)&TmpParam;  //взяли указатель 
  Byte        Addr[]           = "11";
  Byte        PassWord[]       = "TM_DP485";
  Byte        Unit_Type[]      = "MKAB-MGF";
  Word        i;
 
  CLEAR_WDT;
  for(i=0;i<sizeof(Addr);i++)       { TmpParam.DevAddress[i]=Addr[i];} 
  for(i=0;i<sizeof(PassWord);i++)   { TmpParam.PassWord[i]=PassWord[i];}               
  for(i=0;i<sizeof(Unit_Type);i++)  { TmpParam.Unit_Type[i]=Unit_Type[i];}  

  TmpParam.MAIN_BOUD_RATE     = 38400;
  TmpParam.MAIN_timeout       = 500;
  
