diroik/STM32WS/MKAB_LAST_WORK_WDT/src/Classes.cpp
  TmpParam.wReserved[0]       = 26; // et
  TmpParam.wReserved[1]       = 1;  // en
  TmpParam.wReserved[2]       = 1;  // pn
  
  
  Len = sizeof(TmpParam);
  WriteBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
}
//=============================================================================
//  
//=======================================
void TObject::WriteBufToPage(Byte const * PageAddr, Byte *Buf, Word BufLen)
{
  ClrFlashSegment( PageAddr );
  Buf[BufLen] = 0xAA;
  BufLen++;
  WriteByteToFlash_MY(PageAddr, BufLen, Buf);
}
//=============================================================================
//  
//=======================================
void TObject::SimpleWriteBufToPage(Byte const *PageAddr, Byte *Buf, Word BufLen)
{
  ClrFlashSegment( PageAddr );
   for (Word i=0; i < BufLen; i++)
   {
      CLEAR_WDT;
      if(i == 511)
      { CLEAR_WDT;}
      WriteByteToFlash(Buf[i],PageAddr++);
   }
}
//=============================================================================
//  
//=======================================
void  TObject::WriteHexBufToPage(Byte const * PageAddr, Byte *HexBuf, Word BufLen)
{
 Byte TmpMass[3] = {0,0,0};
 Byte TmpByte;
 DWord TmpWord = (DWord)PageAddr;
 
 if( TmpWord == 0xFE00)
 {
   Word const *TmpWordPtr = (Word const*)0xFFFE;
   TmpWord     = *TmpWordPtr;
   ClrFlashSegment( PageAddr );
   WriteWordToFlash(TmpWord, TmpWordPtr);
   BufLen -=2;
 }
 else
 {
    ClrFlashSegment( PageAddr );  
 }
  for (Word i=0; i < (BufLen/2); i++)
  {
    TmpMass[0]  = HexBuf[i*2]; 
    TmpMass[1]  = HexBuf[i*2+1];
    TmpByte     = TBuffer::HexToWord(TmpMass);
    WriteByteToFlash(TmpByte,PageAddr++);
    CLEAR_WDT;      
   }
}
//=============================================================================
//  
//=======================================
void  TObject::WriteLongHexBufToPage(Byte const * PageAddr, Byte *HexBuf, Word BufLen)
{
 Byte TmpMass[3] = {0,0,0};
 Byte TmpByte;
 //DWord TmpWord = (DWord)PageAddr;
 
  ClrFlashSegment( PageAddr );  

  for (Word i=0; i < (BufLen/2); i++)
  {
    TmpMass[0]  = HexBuf[i*2]; 
    TmpMass[1]  = HexBuf[i*2+1];
    TmpByte     = TBuffer::HexToWord(TmpMass);
    WriteByteToFlash(TmpByte,PageAddr++);
   CLEAR_WDT;      
   }

}
//=============================================================================
Word  TObject::ReturnFlashCRC(Byte const * PageAddr, Word BufLen)
{
Word CRC_SUM = 0;
   while(BufLen--)
   {
     CLEAR_WDT;      
     CRC_SUM += *PageAddr++;
   }
   return CRC_SUM;
}
//=============================================================================
Word  TObject::ReturnLongFlashCRC(Byte const * PageAddr, Word BufLen)
{
Word CRC_SUM = 0;
   while(BufLen--)
   {
     CLEAR_WDT;      
     CRC_SUM += *PageAddr++;
   }
   return CRC_SUM;
}


//--------------------------------------------------------------------------------------------------
// 
//--------------------------------------------------------------------------------------------------
FLASH_Status FLASH_GetBank1Status(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;
  
  if((FLASH->SR & FLASH_FLAG_BANK1_BSY) == FLASH_FLAG_BSY) 
  {
    flashstatus = FLASH_BUSY;
  }
  else 
  {  
    if((FLASH->SR & FLASH_FLAG_BANK1_PGERR) != 0)
    { 
      flashstatus = FLASH_ERROR_PG;
    }
    else 
    {
      if((FLASH->SR & FLASH_FLAG_BANK1_WRPRTERR) != 0 )
      {
        flashstatus = FLASH_ERROR_WRP;
      }
      else
      {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  /* Return the Flash Status */
  return flashstatus;
}



//--------------------------------------------------------------------------------------------------
// 
//--------------------------------------------------------------------------------------------------
FLASH_Status FLASH_WaitForLastOperation(uint32_t Timeout)
{ 
  FLASH_Status status = FLASH_COMPLETE;
   
  /* Check for the Flash Status */
  status = FLASH_GetBank1Status();
  /* Wait for a Flash operation to complete or a TIMEOUT to occur */
  while((status == FLASH_BUSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  /* Return the operation status */
  return status;
}



////=============================================================================
////  
////=======================================
bool TObject::ClrFlashSegment(Byte const *SegAddr)
{  
Byte status = FLASH_COMPLETE;
FLASH->KEYR = FLASH_KEY1;
FLASH->KEYR = FLASH_KEY2;


FLASH->SR = FLASH_FLAG_EOP;
FLASH->SR = FLASH_FLAG_PGERR;
FLASH->SR = FLASH_FLAG_WRPRTERR;


while (FLASH->SR & FLASH_SR_BSY);
if (FLASH->SR & FLASH_SR_EOP) {
        FLASH->SR = FLASH_SR_EOP;
}

FLASH->CR |= FLASH_CR_PER;
FLASH->AR = *(uint32_t*)&SegAddr;
FLASH->CR |= FLASH_CR_STRT;
while (!(FLASH->SR & FLASH_SR_EOP));
FLASH->SR = FLASH_SR_EOP;
FLASH->CR &= ~FLASH_CR_PER;

FLASH->CR |= CR_LOCK_Set;
  /* Return the Erase Status */
return status;
}

FLASH_Status FLASH_ProgramWord(uint32_t Address, uint32_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;
  __IO uint32_t tmp = 0;


  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(ProgramTimeout);
  
  if(status == FLASH_COMPLETE)
  {
    /* if the previous operation is completed, proceed to program the new first 
    half word */
    FLASH->CR |= CR_PG_Set;
  
    *(__IO uint16_t*)Address = (uint16_t)Data;
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation(ProgramTimeout);
 
    if(status == FLASH_COMPLETE)
    {
      /* if the previous operation is completed, proceed to program the new second 
      half word */
      tmp = Address + 2;

      *(__IO uint16_t*) tmp = Data >> 16;
    
      /* Wait for last operation to be completed */
      status = FLASH_WaitForLastOperation(ProgramTimeout);
        
      /* Disable the PG Bit */
      FLASH->CR &= CR_PG_Reset;
    }
    else
    {
      /* Disable the PG Bit */
      FLASH->CR &= CR_PG_Reset;
    }
  }         
   
  /* Return the Program Status */
  return status;
}





