diroik/STM32WS/MKAB_LAST_WORK_WDT/src/Classes.cpp
bool TObject::WriteByteToFlash_MY(Byte const * PageAddr, Word size_wr, Byte* ram_buf)
{
//static Byte buffer_for_write[4];
static Byte i;

FLASH->KEYR = FLASH_KEY1;													
FLASH->KEYR = FLASH_KEY2;

//FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);	  // Clear All pending flags
FLASH->SR = FLASH_FLAG_EOP;
FLASH->SR = FLASH_FLAG_PGERR;
FLASH->SR = FLASH_FLAG_WRPRTERR;


for(i=0;i<size_wr/4;i++)
    {
    FLASH_ProgramWord(*(uint32_t *) &PageAddr,*(uint32_t *) &ram_buf[i*4]); // запись 4х байтового слова
    PageAddr = PageAddr +4;
    }

  FLASH->CR |= CR_LOCK_Set;
  return true;
}
//=============================================================================
//  
//=======================================
bool TObject::WriteWordToFlash( Word data, Word const *Addr )
{

    return true;
}
//=============================================================================
//  
//=======================================
bool TObject::WriteBlockToFlash( Word* data, Word const *Addr )
{

  //Byte Len = 32;


    return true;
}
//=============================================================================
//  
//=======================================
//#pragma optimize=z none
void  TObject::Soft_Reset(void)//inline
{
      __disable_interrupt();
    NVIC_SystemReset();
    
    //while(1);//wdt
  
}
//=============================================================================
//  
//=======================================
void   TObject::DirectJump(Word Addr)
{
}
//*****************************************************************************
//*** Class TObjectTask
//*****************************************************************************
//=============================================================================
//  
//=======================================
bool TObjectTask::Save_TaskConfigInFlash(TTaskListConfig *taskListConfig)
{
  //Перезапись всей страницы с временным(защитным) хранилищем в другой странице 
 Word         Len;
 Byte        *Tmp                  = (Byte *)taskListConfig;  //взяли указатель 
  
  Len = sizeof(*taskListConfig); 
  taskListConfig->CRC_SUM = TObjectTask::CalcCRC(taskListConfig);
  
  for(Word i=0; i<3; i++)
  {
    TObject::WriteBufToPage((Byte const*)&TMP_TASK_PARAMS, Tmp, Len-1 );  //записали во временную(защитную) память
    TObject::WriteBufToPage((Byte const*)&TASK_PARAMS    , Tmp, Len-1 );  //записали куда надо
  
    if(TObject::VerifyMemory((Byte const*)&TASK_PARAMS,Tmp, Len-1))
    {//удалили временную запись 
      TObject::ClrFlashSegment( (Byte const*)&TMP_TASK_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;
}
//=============================================================================
//  
//=======================================
Word TObjectTask::CalcCRC(TTaskListConfig const*taskListConfig)
{
  Word crc = 0;
  Byte *Tmp = (Byte *)taskListConfig;  //взяли указатель 
  Word Len  = sizeof(*taskListConfig); 
  Len-=4;
  
  for(Word i=0; i<Len; i++)
  {
    crc+=Tmp[i];
  }
  return crc;
}
//=============================================================================
//  
//=======================================
void TObjectTask::RestoreDefault(void)
{
  Word               Len;
  TTaskListConfig    TmpParam;
  Byte               *Tmp         = (Byte *)&TmpParam;  //взяли указатель 
 
  Len = sizeof(TmpParam);
  TBuffer::ClrBUF(Tmp, Len);

  CLEAR_WDT;
  
  TmpParam.AdcMultiplier      = 4096;
  TmpParam.ReglamentTime      = 600;
  
  for(Byte i=0;i<MAX_ADC_INPUTS;i++)
  { TmpParam.CalVolt[i]=1.0;}
  
  TmpParam.IsFistStart        = true;
  TmpParam.KeyByte          = 0xAA;

  Save_TaskConfigInFlash(&TmpParam);
}
//=============================================================================
//  
//=======================================
bool TObjectTask::RestoreMemParams(void)
{
 Word             Len;
 TTaskListConfig  TmpParam            = *TaskListConfig;     //сохранили текущие значения 
 Byte            *Tmp                 = (Byte *)&TmpParam;  //взяли указатель 
  
  Len = sizeof(TmpParam);
  for(Word i = 0;i<3;i++)
  {
    TObject::WriteBufToPage((Byte const*)&TASK_PARAMS    , Tmp, Len-1 );  //записали куда надо
    if(TObject::VerifyMemory((Byte const*)&TASK_PARAMS,Tmp, Len))
    {//удалили временную запись 
      TObject::ClrFlashSegment( (Byte const*)&TMP_TASK_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;
}



//*****************************************************************************
//*** Class TObjectCalibr
//*****************************************************************************
//=============================================================================
//  
//=======================================
bool TObjectCalibr::Save_CalibrConfigInFlash(TCalibrListConfig *CalibrListConfig)
{
 //Вся процедура была закомментирована в версии 4.1....  
 /*//Перезапись всей страницы с временным(защитным) хранилищем в другой странице 
 Word         Len;
 Byte        *Tmp                  = (Byte *)CalibrListConfig;  //взяли указатель 
  
  Len = sizeof(*CalibrListConfig); 
  CalibrListConfig->CRC_SUM = TObjectCalibr::CalcCRC(CalibrListConfig);
  
  for(Word i=0; i<3; i++)
  {
    TObject::WriteBufToPage((Byte const*)&TMP_CALIBR_PARAMS, Tmp, Len-1 );  //записали во временную(защитную) память
    TObject::WriteBufToPage((Byte const*)&CALIBR_PARAMS    , Tmp, Len-1 );  //записали куда надо
  
    if(TObject::VerifyMemory((Byte const*)&CALIBR_PARAMS,Tmp, Len-1))
    {//удалили временную запись 
      TObject::ClrFlashSegment( (Byte const*)&TMP_CALIBR_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;*/
}
//=============================================================================
//  
//=======================================
Word TObjectCalibr::CalcCRC(TCalibrListConfig const*CalibrListConfig)
{
  Word crc = 0;
  Byte *Tmp = (Byte *)CalibrListConfig;  //взяли указатель 
  Word Len  = sizeof(*CalibrListConfig); 
  Len-=4;
  
  for(Word i=0; i<Len; i++)
  {
    crc+=Tmp[i];
  }
  return crc;
}
//=============================================================================
//  
//=======================================
void TObjectCalibr::RestoreDefault(void)
{
  Word               Len;
  TCalibrListConfig    TmpParam;
  Byte               *Tmp         = (Byte *)&TmpParam;  //взяли указатель 
 
  Len = sizeof(TmpParam);
  TBuffer::ClrBUF(Tmp, Len);
  CLEAR_WDT;
  for(Byte i=0;i<MAX_ADC_INPUTS;i++)
  { TmpParam.CalVolt[i]=1.0;}

  TmpParam.IsFistStart=true;
  TmpParam.KeyByte= 0xAA;

  Save_CalibrConfigInFlash(&TmpParam);
}
//=============================================================================
//  
//=======================================
bool TObjectCalibr::RestoreMemParams(void)
{
// Word             Len;
// TCalibrListConfig  TmpParam            = *CalibrListConfig;     //сохранили текущие значения 
// Byte            *Tmp                 = (Byte *)&TmpParam;  //взяли указатель 
//  
//  Len = sizeof(TmpParam);
//  for(Word i = 0;i<3;i++)
//  {
//    TObject::WriteBufToPage((Byte const*)&CALIBR_PARAMS    , Tmp, Len-1 );  //записали куда надо
//    if(TObject::VerifyMemory((Byte const*)&CALIBR_PARAMS,Tmp, Len))
//    {//удалили временную запись 
//      TObject::ClrFlashSegment( (Byte const*)&TMP_CALIBR_PARAMS );
//      return true; 
//    }
//    else
//    { continue;}
//  }
  return false;
}
//*****************************************************************************
//*** Class TDispatcher
//*****************************************************************************
TDispatcher::TDispatcher()
{
  
