diroik/STM32WS/MKAB_LAST_WORK_WDT/src/Classes.cpp
  //HexToByte(HEX, (Byte)( WORD >> 8) );
  //HexToByte(&HEX[2], (Byte)( WORD) );
    
  //sscanf((char*)ptr, "%X", &number);
  //return number;
  
  return number.Data_s;
}
//=============================================================================
//
//=======================================
/*
DWord TBuffer::HexToDWord(Byte *Ptr)
{
  DWord number = 0;
    
  sscanf((char*)Ptr, "%lX", &number);
  return number;
}*/
//=============================================================================
//
//=======================================
sWord TBuffer::HexToByte(Byte *ptr)
{
   Byte ch  = *ptr++;
   Byte k   = 0;      
   Byte result[2] = {0,0};  

  while(k < 2)
  { 
    CLEAR_WDT;
    if( (ch >= 'A') && (ch <= 'F') ) 
    {  result[k] = (ch - 'A') + 10; } 
    else if( (ch >= '0') && (ch <= '9') ) 
    {  result[k] = ch - '0';} 
    else
    {  return -1;}
    ch = *ptr++;   
    k++;
  }
  return (result[0] <<= 4) + result[1];
}
//=============================================================================
//
//=======================================
void TBuffer::ByteToHex(Byte *HEX, Byte BYTE)
{
 Byte ch = (BYTE >> 4) & 0x0F;
 Byte k  = 0;
  
   while(k < 2)
   {
     CLEAR_WDT;
     if(ch > 9)
     {  *HEX++ = ch + 'A' - 10;}  
     else 
     {  *HEX++ = ch + '0';}
  
     ch = BYTE & 0x0F;
     k++;
   }
   HEX = NULL;
}
//=============================================================================
//
//=======================================
void TBuffer::WordToHex(Byte *HEX, Word WORD)
{
  ByteToHex(HEX, (Byte)( WORD >> 8) );
  ByteToHex(&HEX[2], (Byte)( WORD) );
}
//=============================================================================
//
//=======================================
void TBuffer::DWordToHex(Byte *HEX, DWord DWORD)
{
  WordToHex(HEX, (Word)( DWORD >> 16) );
  WordToHex(&HEX[4], (Word)( DWORD) );
}
//=============================================================================
//
//=======================================
Word TBuffer::CopyString(Byte* DestStr, Byte* SrcStr)
{
  Word len = 0;
  
  while(*SrcStr)
  {
    *DestStr++ = *SrcStr++;
    len++;
    CLEAR_WDT;    
  }

  *DestStr = 0;
  return len;
}       
//=============================================================================
//
//=======================================
/*Byte TBuffer::FloatToString(Byte *ReturnBUF, float Val, Byte AllSymb, Byte AfteComma)
{
  Word begin_val = (Word)Val;
  Word after_val = (Word)((Val - begin_val) * pow(10.0,AfteComma)) ;
  
  Word val;
  
  Val = (Val - begin_val);
  
  for (Byte i= 1;AllSymb+1>i;i++)
    {
      Word mult = (Word)pow(10.0, (AllSymb-i));
      val = begin_val/mult + 0x30;
      begin_val = begin_val%mult;
      ReturnBUF[i-1] = (Byte)val;
    }
  
  ReturnBUF[AllSymb] = 0x2E;
  
  for (Byte j= 1;AfteComma+1>j;j++)
    {
    Word mult = (Word)pow(10.0,(AfteComma -j));
    val = after_val/mult + 0x30;
    after_val = after_val%mult;
    ReturnBUF[AllSymb + j] = (Byte)val;
    }

//  sprintf((char*)ReturnBUF,"%0*.*f",AllSymb,AfteComma,Val);
  return AllSymb;
}*/
//=============================================================================
//
//=======================================
//#pragma optimize=z none
string TBuffer::FloatToString(float Val, Byte AllSymb, Byte AfteComma)
{
  Word begin_val = (Word)Val;
  Word after_val = (Word)( (Val - begin_val) * pow(10.0, AfteComma) );
 
  return IntToString(begin_val) + "." + IntToString(after_val, AfteComma);
}
//=============================================================================
//
//=======================================
string TBuffer::IntToString(int Val, Byte AllSymb)
{
  if(Val == 0 && AllSymb == 0)
    return "0";
  char buff[16] ={0};
  if(AllSymb == 0)
  { 
    while(Val >=  (Word)pow(10.0, AllSymb))
      AllSymb++;
  }
  
  for (Byte i= 1;AllSymb+1>i;i++)
  {
      Word mult = (Word)pow(10.0, (AllSymb-i));
      Word val = Val/mult + 0x30;
      Val = Val%mult;
      buff[i-1] = (Byte)val;
  }
  return string(buff);
}
//=============================================================================
//
//=======================================
//#pragma optimize=z none
string TBuffer::LongToString(long Val, Byte AllSymb)
{
  if(Val == 0 && AllSymb == 0)
    return "0";
  char buff[32] ={0};
  if(AllSymb == 0)
  { 
    while(Val >=  pow(10.0, AllSymb))
      AllSymb++;
  }
  
  for (Byte i= 1;AllSymb+1>i;i++)
  {
      long mult = (long)pow(10.0, (AllSymb-i));
      long val = Val/mult + 0x30;
      Val = Val%mult;
      buff[i-1] = (Byte)val;
  }
  return string(buff);
}
/*
//=============================================================================
//
//=======================================
Word TBuffer::NewStringToInt(string Val)
{
string some_string;
istringstream buffer(Val);
Word some_int;
buffer >> some_int;
return some_int;
}

//=============================================================================
//
//=======================================
string TBuffer::NewIntToString(int Val)
{
    ostringstream buffer;
    buffer << Val;
    return buffer.str();
}*/
//=============================================================================
//
//=======================================
string TBuffer::WordToString(Word Val, Byte AllSymb)
{
  char buff[6] = {0x30,0x30,0x30,0x30,0x30,0};
  sByte index = 4;
  Word counter = 1;
  Word tmpcounter = 1;
  Word tmp1;
  Word tmp2;
  
  do
  {
    counter*=10;
    tmp1 = Val/counter;
    tmp2 = Val%counter;
    tmp2 = tmp2/tmpcounter;
    tmpcounter = counter;
    buff[index--] = tmp2+0x30;
  }
  while(tmp1 > 0 && index > 0);
  if(tmp1 > 0)
  { buff[index--] = tmp1+0x30;}
  if(AllSymb > 0)
  {
    sByte i = index+1;
    if(i > 0)
    {
      if(AllSymb > 5) 
      { AllSymb = 5;}
      Byte siz = 5-i;
      i=AllSymb-siz;
      if(i>0)
      {
        index-=i;
      }
    }
  }
  return string(&buff[index+1]);
}
//=============================================================================
//
//=======================================
string TBuffer::DateTimeToString(TRtcTime *datetime)
{
  return  string(
          TBuffer::WordToString(datetime->Day)+'.'+
          TBuffer::WordToString(datetime->Month)+'.'+ 
          TBuffer::WordToString(datetime->Year)+','+
          TBuffer::WordToString(datetime->Hour)+':'+ 
          TBuffer::WordToString(datetime->Minute)+':'+  
          TBuffer::WordToString(datetime->Second) 
                );
  
