diroik/STM32WS/MKAB_LAST_WORK_WDT/src/Classes.cpp
//=============================================================================
// 
//=======================================    
long TDateTime::GetFullGlobalSecond(void)
{ 
  
  return long(GlobalSeconds+(long)((2010-DateTime.Year)*8760+(DateTime.Month*730)+(DateTime.Day*24))*3600);
}

//=============================================================================
// 
//=======================================     
void TDateTime::IncMinute(void)
{
    if(++DateTime.Minute >= 60)
    {
      DateTime.Minute = 0;
      IncHour();
    }
}
//=============================================================================
// 
//=======================================   
void TDateTime::IncHour(void)
{
    if(++DateTime.Hour >= 24)
    {
      DateTime.Hour = 0;
      IncDay();
    }
}
//=============================================================================
// 
//=======================================    
void TDateTime::IncDay(void)
{
   Byte DaysInMonth = 31;
    if(DateTime.Month == 4 || DateTime.Month == 6 || DateTime.Month == 9 || DateTime.Month == 11 )
    { DaysInMonth = 30;}
    else if( DateTime.Month == 2)
    {
      if(IsLeapYear( DateTime.Year ) == true)
      { DaysInMonth = 29;}
      else
      { DaysInMonth = 28;}
    }    
    if(++DateTime.Day > DaysInMonth)
    {
      DateTime.Day = 1;
      IncMonth();
    }
}
//=============================================================================
// 
//=======================================  
void TDateTime::IncMonth(void)
{
    if(++DateTime.Month > 12)
    {
      DateTime.Month = 1;
      DateTime.Year++;
    }
}  
//=============================================================================
// 
//=======================================  
bool TDateTime::IsLeapYear(Word Year) 
{
    // Проверка високосного года
    if( (Year%4 == 0) && ((Year % 100 != 0) || (Year % 400 == 0)) )
    {  return true;} // високосный
    else
    {  return false;} //не високосный
}
//*****************************************************************************
//*****************************************************************************
//*** Class TComPort
//*****************************************************************************
TComPort::TComPort():enabled(false),TTimer(4),commPortHandle(INVALID_HANDLE_VALUE),ByteIndex(0),time_outs(),CRC_SUM(0),StxFlag(false),DataReceiving(false)
{
  DATA_Rx = NULL;
}
//=============================================================================
// Destructor
//=======================================
TComPort::~TComPort()
{
	if (commPortHandle != INVALID_HANDLE_VALUE)
	{	CloseHandle(commPortHandle);}
}
//=============================================================================
//
//=======================================
void TComPort::PushByteToDATA_Rx(Byte Data)
{
  if(DATA_Rx!=NULL)
  {
    DATA_Rx->push(Data);
  }
}
//=============================================================================
//
//=======================================
sWord TComPort::PopByteDATA_Rx(void)
{
  if(DATA_Rx!=NULL)
  { return DATA_Rx->pop();}
  else
  { return -1;}
}
//=============================================================================
// Closes the com port 
//=======================================
bool TComPort::close()
{
	if (commPortHandle != INVALID_HANDLE_VALUE)
	{	CloseHandle(commPortHandle);}
	commPortHandle = INVALID_HANDLE_VALUE;
	return true;
}
//=============================================================================
// Closes the com port Handle
//=======================================
bool TComPort::CloseHandle(HANDLE commPort)
{
  bool flag     = false;
  //Word old_SR   = __get_SR_register();
  //if(old_SR & GIE)
  {flag = true;}
  __disable_interrupt(); 
      switch (commPort)
      {
          case COM0:
              //close_UART0();
              break;
          
          case COM1:
         //     close_UART1();
              break;
          
          default:
              return false;
      } 
  enabled = false;   
  if(flag)
  {__enable_interrupt();}
  return true;
}
//=============================================================================
//=======================================
void TComPort::ClrByteIndex(void)
{
  ByteIndex = 0;
}
//=============================================================================
//=======================================
void TComPort::SetTimeOuts(COMMTIMEOUTS timeouts)
{
  time_outs = timeouts;
}
//=============================================================================
//=======================================        
void TComPort::GetTimeOuts(COMMTIMEOUTS &timeouts)
{
  timeouts = time_outs; 
}
//=============================================================================
// open com port 
//=======================================
HANDLE TComPort::open(Port port, DWord baudRate, DWord ReadIntervalTimeout)
{
  COMMTIMEOUTS timeouts;
  bool flag     = false;
  //Word old_SR   = __get_SR_register();
  //if(old_SR & GIE)
  {flag = true;}
  __disable_interrupt(); 
      switch (port)
      {
        case COM0:
          
GPIOA->CRH = GPIO_CRH_CNF9_1;
GPIOA->CRH |= GPIO_CRH_MODE9;
GPIOA->CRH |= GPIO_CRH_CNF10_0;



//          GPIOA->MODER |= GPIO_MODER_MODER9_1 | GPIO_MODER_MODER10_1;
//          GPIOA->OTYPER &= ~(GPIO_OTYPER_OT_9 | GPIO_OTYPER_OT_10);
//          GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR9 | GPIO_OSPEEDER_OSPEEDR10;
//          GPIOA->PUPDR |= GPIO_PUPDR_PUPDR9_0;
//          
//          GPIOA->AFR[1] |= 0x00000770;
//
          RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
          USART1->CR1 = ( USART_CR1_RE | USART_CR1_TE);

          //Разрешение прерываний
          //USART1->CR1 |= USART_CR1_TXEIE;
          USART1->CR1 |= USART_CR1_RXNEIE;
          //USART1->CR1 |= USART_CR1_TCIE;

          // 38400 Делитель = 8000000/(16*38400) = 13.0416
          USART1->BRR =(13<<4); 	// Целая часть 13
          USART1->CR1 |= USART_CR1_UE;	

          RX_BUF = (Byte*)&USART1->DR;
          TX_BUF = (Byte*)&USART1->DR;
          
